# AlignmentStationLabelSetOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AlignmentStationLabelSetOffset Property
ParameterTypeId Class See Also
---
"Alignment Station Label Set Offset": The text is not used directly anywhere in the UI, instead the XAML specifies its own string for the value's label.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AlignmentStationLabelSetOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AlignmentStationLabelSetOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AlignmentStationLabelSetOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace